/* 
有效的数独
哈希 
*/

/* 
    数组
    rowValid  [row][num] 第row行出现num次数；
    colValid  [col][num] 第col行出现数字num次数；
    areaValid [areR][areC][num] 第areR行第areC列小区域出现num的次数
*/

/* 
    哈希编码 
    (r01, 1) r几+数字，count
    (c01，1) c几+数字，count
    (r0c01, 1) 区域r几c几+数字，count
*/

function isValidSudoku(board: string[][]): boolean {
    const map = new Map();
    for (let i = 0; i < 9; i++) {
        for (let j = 0; j < 9; j++) {
            const v = board[i][j];
            if(v !== '.'){
                const areaI = Math.floor(i / 3);
                const areaJ = Math.floor(j / 3);
                if(map.has(`r${i}${v}`) || map.has(`c${j}${v}`) || map.has(`r${areaI}c${areaJ}${v}`)) return false;
                map.set(`r${i}${v}`, 1);
                map.set(`c${j}${v}`, 1);
                map.set(`r${areaI}c${areaJ}${v}`, 1);
            }
        }
    }
    return true;
};




/* 
输入：board = 
[["5","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
输出：true
*/

isValidSudoku(
    [["5","3",".",".","7",".",".",".","."]
    ,["6",".",".","1","9","5",".",".","."]
    ,[".","9","8",".",".",".",".","6","."]
    ,["8",".",".",".","6",".",".",".","3"]
    ,["4",".",".","8",".","3",".",".","1"]
    ,["7",".",".",".","2",".",".",".","6"]
    ,[".","6",".",".",".",".","2","8","."]
    ,[".",".",".","4","1","9",".",".","5"]
    ,[".",".",".",".","8",".",".","7","9"]]
);